/**-----------------------------------------文件信息---------------------------------------------
**描          述: 时钟、看门狗功能的头文件
**---------------------------------------历史版本信息-------------------------------------------
**修    改    人: 
**日          期: 
**版          本: 
**描          述:
**----------------------------------------------------------------------------------------------
***********************************************************************************************/

#ifndef	__BSP_RTC_WDG_H_
#define	__BSP_RTC_WDG_H_
#ifdef __cplusplus
	extern "C" {
#endif

/* Includes-----------------------------------------------------------------------------------*/ 

/*Defines-------------------------------------------------------------------------------*/
      
#define  RTC_CLK_SOURCE_LSE 

#ifdef RTC_CLK_SOURCE_LSE
  #define RTC_ASYNCH_PREDIV  	31u
  #define RTC_SYNCH_PREDIV   	1023u
#endif
      
/* Type Defines-------------------------------------------------------------------------------*/

typedef struct
{
	uint8_t year;
	uint8_t month;
	uint8_t day;
	uint8_t hour;
	uint8_t min;
	uint8_t sec;
}Datetime_t;

/* Functions ProtoTypes-----------------------------------------------------------------------*/

//extern RTC_HandleTypeDef RtcHandle;

/*************************************
*函数名称: BSP_RtcInit
*函数功能：时钟读写前的初始化
*入口参数：无
*出口参数：无
*返回值： 0: 成功 非0: 错误代码
*版本&日期：
*************************************/
uint8_t	BSP_RtcInit(void);

/*************************************
*函数名称: BSP_RtcRead
*函数功能：时钟读
*入口参数：无
*出口参数：stTime: 读出的时间
*返回值： 0: 成功 非0: 错误代码
*版本&日期：
*************************************/
uint8_t	BSP_RtcRead (void *pstTime);


/*************************************
*函数名称: BSP_RtcReadSecond
*函数功能：时钟读秒
*入口参数：无
*出口参数：秒
*返回值： 
*版本&日期：
*************************************/
uint32_t BSP_RtcReadSecond(void);

/*************************************
*函数名称: BSP_RtcReadSytemSecond
*函数功能：系统秒钟计时器，上电开锁计时
*入口参数：无
*出口参数：秒
*返回值： 
*版本&日期：
*************************************/
uint32_t BSP_RtcReadSytemSecond(void);

/*************************************
*函数名称: BSP_RtcReadSubSecond
*函数功能：时钟读微秒
*入口参数：无
*出口参数：微秒
*返回值： 
*版本&日期：
*************************************/
uint16_t BSP_RtcReadSubSecond(void);

/*************************************
*函数名称: BSP_RtcWrite
*函数功能：时钟写
*入口参数：stTime: 写入的时间
*出口参数：无
*返回值： 0: 成功 非0: 错误代码
*版本&日期：
*************************************/
uint8_t	BSP_RtcWrite (void *pstTime);

/*************************************
*函数名称: BSP_RtcSetWakeUp
*函数功能：设置RTC唤醒周期，使能RTC中断唤醒
*入口参数：无
*出口参数：微秒
*返回值： 
*版本&日期：
*************************************/
uint8_t BSP_RtcSetWakeUp(uint16_t peroid);

/*************************************
*函数名称: BSP_WdgInit
*函数功能：看门狗的初始化
*入口参数：无
*出口参数：无
*返回值： 0: 成功 非0: 错误代码
*版本&日期：
*************************************/
uint8_t	BSP_WdgInit(void);

/*************************************
*函数名称: BSP_WdgEnable
*函数功能：启用看门狗
*入口参数：无
*出口参数：无
*返回值： 0: 成功 非0: 错误代码
*版本&日期：
*************************************/
uint8_t BSP_WdgEnable(void);

/*************************************
*函数名称: BSP_WdgFeed
*函数功能：看门狗喂狗
*入口参数：无
*出口参数：无
*返回值： 0: 成功 非0: 错误代码
*版本&日期：
*************************************/
uint8_t	BSP_WdgFeed(void);

/************************************************************************************************/

#ifdef __cplusplus
}
#endif
#endif	

